/**********************************************************************************************************
                                天穹飞控 —— 致力于打造中国最好的多旋翼开源飞控
                                Github: github.com/loveuav/BlueSkyFlightControl
                                技术讨论：bbs.loveuav.com/forum-68-1.html
 * @文件     waypointControl.c
 * @说明     航点飞行
 * @版本  	 V1.0
 * @作者     BlueSky
 * @网站     bbs.loveuav.com
 * @日期     2018.07 
**********************************************************************************************************/
#include "waypointControl.h"

mavlink_mission_item_t wpItem[0xFF];    //航点信息  
uint16_t wpCount = 0;                   //航点数量
uint16_t wpRecvCount = 0;               //航点接收序号
uint16_t wpSendCount = 0;               //航点发送序号

/**********************************************************************************************************
*函 数 名: GetWaypointCount
*功能说明: 获取航点数量
*形    参: 无
*返 回 值: 航点数量
**********************************************************************************************************/
uint16_t GetWaypointCount(void)
{
    return wpCount;
}

/**********************************************************************************************************
*函 数 名: SetWaypointCount
*功能说明: 设置航点数量
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void SetWaypointCount(uint16_t count)
{
    wpCount = count;
}

/**********************************************************************************************************
*函 数 名: GetWaypointCount
*功能说明: 获取航点接收序号
*形    参: 无
*返 回 值: 航点序号
**********************************************************************************************************/
uint16_t GetWaypointRecvCount(void)
{
    return wpRecvCount;
}

/**********************************************************************************************************
*函 数 名: SetWaypointRecvCount
*功能说明: 设置航点接收序号
*形    参: 航点序号
*返 回 值: 无
**********************************************************************************************************/
void SetWaypointRecvCount(uint16_t count)
{
    wpRecvCount = count;
}

/**********************************************************************************************************
*函 数 名: GetWaypointSendCount
*功能说明: 获取航点发送序号
*形    参: 无
*返 回 值: 航点序号
**********************************************************************************************************/
uint16_t GetWaypointSendCount(void)
{
    return wpSendCount;
}

/**********************************************************************************************************
*函 数 名: SetWaypointSendCount
*功能说明: 设置航点发送序号
*形    参: 航点序号
*返 回 值: 无
**********************************************************************************************************/
void SetWaypointSendCount(uint16_t count)
{
    wpSendCount = count;
}

/**********************************************************************************************************
*函 数 名: SetWaypointItem
*功能说明: 设置航点信息
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void SetWaypointItem(uint16_t count, mavlink_mission_item_t item)
{
    if(count < 0xFF)
    {
        wpItem[count] = item;
        wpRecvCount = count + 1;
    }
}

/**********************************************************************************************************
*函 数 名: ClearAllWaypointItem
*功能说明: 清除所有航点信息
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void ClearAllWaypointItem(void)
{
    for(uint8_t i=0; i<0xFF; i++)
        memset(&wpItem[i], 0, sizeof(mavlink_mission_item_t));
}

/**********************************************************************************************************
*函 数 名: GetWaypointItem
*功能说明: 获取航点信息
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
mavlink_mission_item_t GetWaypointItem(uint16_t count)
{
    return wpItem[count];
}





